Revit 2026 API

# MechanicalSystemBaseEquipmentConnector Property

---

The connector within the base equipment which is used to connect with the system.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Connector BaseEquipmentConnector { get; set; }
```
```vb
Public Property BaseEquipmentConnector As Connector
	Get
	Set
```
```cpp
public:
property Connector^ BaseEquipmentConnector {
	Connector^ get ();
	void set (Connector^ value);
}
```
```fsharp
member BaseEquipmentConnector : Connector with get, set
```

#### Property Value

Connector

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when assigning a connector which is used in a system, or when the connector's owner is not of type 'mechanical equipment'. |
| InvalidOperationException | Thrown when the set operation failed. |

Assigning  to the base equipment connector will disconnect the base equipment from the system.

#### Reference

MechanicalSystem Class

Autodesk.Revit.DB.Mechanical Namespace